## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                          NAME                          |
|----------|--------------------------------------------------------|
| recreate | `aws_iam_policy.ai-answers-ssm-policy`                 |
|          | `aws_iam_policy_attachment.ai-answers-ssm-policy`      |
|          | `aws_iam_role.ai-answers-ecs-role`                     |
|          | `aws_iam_role_policy_attachment.ai-answers-ecs-policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.ai-answers-ssm-policy must be replaced
-/+ resource "aws_iam_policy" "ai-answers-ssm-policy" {
      ~ arn              = "arn:aws:iam::992382783569:policy/ai-answers-ssm-policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Policy for AI Answers to access SSM parameters" -> "Policy for ai-answers staging to access SSM parameters" # forces replacement
      ~ id               = "arn:aws:iam::992382783569:policy/ai-answers-ssm-policy" -> (known after apply)
      ~ name             = "ai-answers-ssm-policy" -> "ai-answers-staging-ssm-policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPA6ODU7SBIQOCZ6UOT2" -> (known after apply)
        tags             = {
            "CostCentre" = "ai-answers-staging"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy_attachment.ai-answers-ssm-policy must be replaced
-/+ resource "aws_iam_policy_attachment" "ai-answers-ssm-policy" {
      - groups     = [] -> null
      ~ id         = "ai-answers-ssm-policy" -> (known after apply)
      ~ name       = "ai-answers-ssm-policy" -> "ai-answers-staging-ssm-policy-attachment" # forces replacement
      ~ policy_arn = "arn:aws:iam::992382783569:policy/ai-answers-ssm-policy" -> (known after apply) # forces replacement
      ~ roles      = [
          - "ai-answers-ecs-role",
          + "ai-answers-staging-ecs-role",
        ]
      - users      = [] -> null
    }

  # aws_iam_role.ai-answers-ecs-role must be replaced
-/+ resource "aws_iam_role" "ai-answers-ecs-role" {
      ~ arn                   = "arn:aws:iam::992382783569:role/ai-answers-ecs-role" -> (known after apply)
      ~ create_date           = "2025-02-07T18:51:58Z" -> (known after apply)
      ~ id                    = "ai-answers-ecs-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::992382783569:policy/ai-answers-ssm-policy",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
      ~ name                  = "ai-answers-ecs-role" -> "ai-answers-staging-ecs-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA6ODU7SBIYZAA5HTR6" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ai-answers-ecs-policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ai-answers-ecs-policy" {
      ~ id         = "ai-answers-ecs-role-20250207185158701000000001" -> (known after apply)
      ~ role       = "ai-answers-ecs-role" -> "ai-answers-staging-ecs-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ ai-answers-ecs-policy_attachment = {
      ~ id         = "ai-answers-ecs-role-20250207185158701000000001" -> (known after apply)
      ~ role       = "ai-answers-ecs-role" -> "ai-answers-staging-ecs-role"
        # (1 unchanged attribute hidden)
    }
  ~ iam_role_ai-answers-ecs-role_arn = "arn:aws:iam::992382783569:role/ai-answers-ecs-role" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ai-answers-ecs-role"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
